import * as yup from 'yup';

export const nameValidation = yup
  .string(`Введіть своє ім'я`)
  .min(3, 'Довжина імені має бути мінімум 3 символи')
  .max(254, 'Надто довго!')
  .required(`Необхідно вказати ім'я`);

export const emailValidation = yup
  .string('Введіть адресу електронної пошти')
  .min(3, 'Довжина емейлу має бути мінімум 3 символи')
  .max(254, 'Надто довго!')
  .email(
    `Введіть дійсний емейл, повинен обов'язково містити знак "@" і "крапку"`
  )
  .required('Необхідно вказати адресу електронної пошти');

export const passwordValidation = yup
  .string('Введіть ваш пароль')
  .min(8, 'Довжина пароля повинна бути мінімум 8 символів')
  .max(100, 'Надто довго!')
  .required('Необхідно ввести пароль');
