import * as yup from 'yup';

const REG_EXP = '^[A-Za-z0-9]+$';

export const nameValidation = yup
  .string(`Введіть своє ім'я`)
  .min(3, 'Довжина імені має бути мінімум 3 символи')
  .max(254, 'Надто довго!')
  .required(`Необхідно вказати ім'я`);

export const emailValidation = yup
  .string('Введіть адресу електронної пошти')
  .min(3, 'Довжина пошти має бути мінімум 3 символи')
  .max(254, 'Надто довго!')
  .email(`Повинна обов'язково містити знак "@" і "крапку"`)
  .required('Необхідно вказати адресу електронної пошти');

export const passwordValidation = yup
  .string('Введіть ваш пароль')
  .matches(REG_EXP, 'Може містити лише латинський алфавіт та цифри')
  .min(8, 'Довжина повинна бути мінімум 8 символів')
  .max(100, 'Надто довго!')
  .required('Необхідно ввести пароль');
