export const quotes = [
  {
    author: 'Д.Дідро',
    text: 'Лікарі безперервно працюють над збереженням нашого здоров’я, а кухарі – над його руйнуванням; проте останні більш впевнені в успіху.',
  },
  {
    author: 'Аристип',
    text: 'Від того, що людина багато їсть, вона не стає здоровішою… Так само і вчений – це не той, хто багато читає, а той, хто читає з користю.',
  },
  {
    author: 'А.Чехов',
    text: 'Вставши із-за столу голодним – ви наїлись; якщо ви встали наївшись – ви переїли; якщо встаєте переївши – ви отруїлись.',
  },
  {
    author: 'Б.Франклін',
    text: 'Якщо хочеш продовжити своє життя, приборкай свою трапезу.',
  },
  {
    author: 'М. де Сервантес',
    text: 'За обідом їж мало, а вечеряй ще менше, тому що здоров’я всього тіла кується в кузні нашого шлунку.',
  },
  {
    author: 'Піфагор',
    text: 'Ніхто не повинен переступати міру ні в їжі, ні в питті.',
  },
  {
    author: 'Ціцерон',
    text: 'Їсти і пити потрібно стільки, щоб наші сили цим відновлювались, а не пригнічувались.',
  },
  {
    author: 'А.Цельс',
    text: 'Надмірне наповнення шлунку шкідливе для здоров’я.',
  },
  {
    author: 'Іоанн Златоуст',
    text: 'Обмежуйтесь рослинами, якщо хочете харчуватись достатньо і здорово.',
  },
  {
    author: 'А.Джамі',
    text: 'Їж стільки, щоб тіло не гинуло від переїдання.',
  },
  {
    author: 'Ф. де Ларошфуко',
    text: ' Стриманість в їжі породжена або турботою про здоров’я, або нездатністю багато з’їсти.',
  },
  {
    author: 'А.Брійя-Соварєн',
    text: 'Якщо ми засуджені на те, щоб їсти, будемо їсти добре.',
  },
  {
    author: 'А.Брійя-Соварєн',
    text: ' Творець, який зобов’язав людину їсти для того, щоб жити, пробуджує її до цього апетитом і нагороджує за це задоволенням.',
  },
  {
    author: 'Марк Твен',
    text: 'Єдиний спосіб зберегти здоров’я – це їсти те, чого не хочемо, пити те, чого не любимо, і робити те, що не подобається.',
  },
  {
    author: 'І.П.Павлов',
    text: '  Якщо надмірне захоплення їжею є звірство, то й зневага до їжі є нерозумною,  і істина тут, як і скрізь, лежить посередині: не захоплюйся, але приділяй належну увагу.',
  },
  {
    author: 'Ф.Г.Раневська',
    text: 'Природа досить вдало продумала будову нашого організму. Щоб ми бачили, скільки ми переїдаємо, наш живіт розміщений на тій же стороні тіла, що й очі.',
  },
  {
    author: 'Арнольд Глазгоу',
    text: 'Тіло – багаж, який несеш усе життя. Чим він важчий, тим коротша подорож.',
  },
  {
    author: 'Н. де Ротшильд',
    text: 'Хороших дієт не буває.',
  },
  {
    author: 'Френк Ллойд Райт',
    text: ' Щоб по-справжньому схуднути, достатньо відмовитися від трьох речей – сніданку, обіду, вечері.',
  },
  {
    author: 'О.Вулкотт',
    text: 'Все, що мені подобається, або протипоказано, або аморально, або веде до ожиріння.',
  },
];
